Security.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcc777ec">1. Security</a>
<ul>
<li><a href="#org611ffc8">1.1. Node.js - security</a>
<ul>
<li><a href="#orgd4caae9">1.1.1. CSRF protection</a>
<ul>
<li><a href="#org485ee89">1.1.1.1. Express CSRF middleware ignores verifying tokens on HTTP `GET`, `OPTIONS` and</a></li>
<li><a href="#org09e2f26">1.1.1.2. Ensure `GET` APIs are non-mutating.</a></li>
</ul>
</li>
<li><a href="#org7acdf8a">1.1.2. Preventing internal implementation disclosure</a>
<ul>
<li><a href="#orgede445f">1.1.2.1. Remove the `X-Powered-By` header.</a></li>
<li><a href="#orgf27b3cf">1.1.2.2. Change the default session cookie name (from `connect.sid`)</a></li>
</ul>
</li>
<li><a href="#orga551604">1.1.3. XSS protection</a>
<ul>
<li><a href="#orgd473f22">1.1.3.1. It's a myth that template libraries handle output encoding by default, making the application safe from XSS attacks.</a></li>
<li><a href="#org3da4e95">1.1.3.2. Encode untrusted data for <span class="underline">correct context</span>, depending on where it will reside.</a></li>
<li><a href="#orgdfa3a87">1.1.3.3. Use proven utilities for encoding.</a></li>
<li><a href="#orgad4edee">1.1.3.4. DOM-based XSS: Encode both on the server and client side.</a></li>
<li><a href="#org9e2349e">1.1.3.5. Add `HTTPOnly`, `Secure` attributes on the Session cookie:</a></li>
<li><a href="#org7366d8b">1.1.3.6. Add <b>content security policy</b> header</a></li>
</ul>
</li>
<li><a href="#org1a5f582">1.1.4. HTTP parameter pollution</a>
<ul>
<li><a href="#orge8d9b38">1.1.4.1. trigger type errors on the server (uncaught errors crash it and cause DoS)</a></li>
<li><a href="#org85e43d3">1.1.4.2. modify application behavior (e.g. store arrays in the DB)</a></li>
<li><a href="#orgaf02205">1.1.4.3. bypass input validation applied on strings in the code, WAF, browser filters</a></li>
<li><a href="#org3ba2177">1.1.4.4. <b>Check the expected type</b> as a part of input validation.</a></li>
<li><a href="#org47f0e3d">1.1.4.5. Incorporate <b>input fuzzing</b> into test suites to discover problems.</a></li>
<li><a href="#org182f393">1.1.4.6. Implement a <b>robust error handling mechanism</b>, using `try/catch`, `domain` and `cluster`.</a></li>
</ul>
</li>
<li><a href="#orgf7a1b9f">1.1.5. Regular Expression Denial of Service (REDoS)</a>
<ul>
<li><a href="#orgb0a8aa0">1.1.5.1. Grouping with repetition</a></li>
<li><a href="#org6b40ed5">1.1.5.2. Inside repeated group, repetition (`(a+)+`) or alternation with overlapping (`(a|aa)+`)</a></li>
<li><a href="#orgeffb7dd">1.1.5.3. Example: Input pattern `aaaaaaaaaaaaa!` for a commonly used URL validation regexp</a></li>
</ul>
</li>
<li><a href="#orgb89374a">1.1.6. Don't use eval</a></li>
<li><a href="#org69680d8">1.1.7. Avoid command injection</a></li>
<li><a href="#org8507e07">1.1.8. Temp files</a></li>
<li><a href="#org5abbc66">1.1.9. Cookie theft</a></li>
<li><a href="#org08b194a">1.1.10. Content Security Policy</a></li>
<li><a href="#orgaa02982">1.1.11. Tools</a>
<ul>
<li><a href="#org41259a0">1.1.11.1. Helmet</a></li>
<li><a href="#orgac891cc">1.1.11.2. npm shrinkwrap</a></li>
<li><a href="#orgee9cf2e">1.1.11.3. retire.js</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcc777ec" class="outline-2">
<h2 id="orgcc777ec"><span class="section-number-2">1</span> Security</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org611ffc8" class="outline-3">
<h3 id="org611ffc8"><span class="section-number-3">1.1</span> Node.js - security</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgd4caae9" class="outline-4">
<h4 id="orgd4caae9"><span class="section-number-4">1.1.1</span> CSRF protection</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-javascript">app.use<span style="color: #c5c8c6;">(</span>express.csrf<span style="color: #8abeb7;">()</span><span style="color: #c5c8c6;">)</span>;
app.use<span style="color: #c5c8c6;">(</span><span style="color: #b5bd68;">function</span><span style="color: #8abeb7;">(</span><span style="color: #f0c674;">req</span>, <span style="color: #f0c674;">res</span>, <span style="color: #f0c674;">next</span><span style="color: #8abeb7;">)</span> <span style="color: #8abeb7;">{</span>
    res.locals.csrftoken = req.csrfToken<span style="color: #f0c674;">()</span>;
    next<span style="color: #f0c674;">()</span>;
<span style="color: #8abeb7;">}</span>
</pre>
</div>

<p>
And then somewhere in the HTML:
</p>
<pre class="example">
&lt;input type="hidden" name="_csrf" value="{{csrftoken}}"&gt;
</pre>
</div>

<div id="outline-container-org485ee89" class="outline-5">
<h5 id="org485ee89"><span class="section-number-5">1.1.1.1</span> Express CSRF middleware ignores verifying tokens on HTTP `GET`, `OPTIONS` and</h5>
<div class="outline-text-5" id="text-1-1-1-1">
<p>
`HEAD` requests.
</p>
</div>
</div>
<div id="outline-container-org09e2f26" class="outline-5">
<h5 id="org09e2f26"><span class="section-number-5">1.1.1.2</span> Ensure `GET` APIs are non-mutating.</h5>
</div>
</div>

<div id="outline-container-org7acdf8a" class="outline-4">
<h4 id="org7acdf8a"><span class="section-number-4">1.1.2</span> Preventing internal implementation disclosure</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><div id="outline-container-orgede445f" class="outline-5">
<h5 id="orgede445f"><span class="section-number-5">1.1.2.1</span> Remove the `X-Powered-By` header.</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<div class="org-src-container">
<pre class="src src-javascript">app.disable<span style="color: #c5c8c6;">(</span><span style="color: #8abeb7;">"x-powered-by"</span><span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf27b3cf" class="outline-5">
<h5 id="orgf27b3cf"><span class="section-number-5">1.1.2.2</span> Change the default session cookie name (from `connect.sid`)</h5>
<div class="outline-text-5" id="text-1-1-2-2">
<div class="org-src-container">
<pre class="src src-javascript">app.use<span style="color: #c5c8c6;">(</span>express.session<span style="color: #8abeb7;">(</span><span style="color: #f0c674;">{</span>
    secret: <span style="color: #8abeb7;">"13375UP4H4X0R"</span>,
    key: <span style="color: #8abeb7;">"yourCusomtKey"</span>,
    <span style="color: #969896; font-style: italic;">/* </span><span style="color: #969896; font-style: italic;">... */</span>
<span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga551604" class="outline-4">
<h4 id="orga551604"><span class="section-number-4">1.1.3</span> XSS protection</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><div id="outline-container-orgd473f22" class="outline-5">
<h5 id="orgd473f22"><span class="section-number-5">1.1.3.1</span> It's a myth that template libraries handle output encoding by default, making the application safe from XSS attacks.</h5>
</div>
<div id="outline-container-org3da4e95" class="outline-5">
<h5 id="org3da4e95"><span class="section-number-5">1.1.3.2</span> Encode untrusted data for <span class="underline">correct context</span>, depending on where it will reside.</h5>
<div class="outline-text-5" id="text-1-1-3-2">
<ul class="org-ul">
<li>HTML Body
<ul class="org-ul">
<li>&amp; -&gt; `&amp;amp;`</li>
<li>&lt; -&gt; `&amp;lt;`</li>
<li>&gt; -&gt; `&amp;gt;`</li>
<li>" -&gt; `&amp;quot;`</li>
<li>' -&gt; `&amp;#x27;`</li>
<li>/ -&gt; `&amp;#x2F;`</li>
</ul></li>
<li>HTML attributes
<ul class="org-ul">
<li>e.g. `&lt;input type="text" name="firstname" value="{untrusted}"&gt;`</li>
<li>Non-alphanumeric chars -&gt; `&amp;#xHH;` format</li>
</ul></li>
<li>CSS
<ul class="org-ul">
<li>e.g. `&lt;div style="width={untrusted};"&gt;contents&lt;/div&gt;`</li>
<li>Untrusted ata -&gt; CSS hex encoding (`\HH` or `\HHHHHH`)</li>
</ul></li>
<li>JS
<ul class="org-ul">
<li>e.g. `&lt;script&gt;var firstName="{untrusted}"&lt;/script&gt;`</li>
<li>Non-alphanumeric chars -&gt; `\uXXXX;` unicode format</li>
</ul></li>
<li>URL
<ul class="org-ul">
<li>e.g. `&lt;a href="{untrusted}"&gt;Show details&lt;/a&gt;`</li>
<li>Untrusted data -&gt; `encodeURI()`</li>
</ul></li>
<li>URL parameter
<ul class="org-ul">
<li>e.g. `&lt;a href="/account?id={untrusted}"&gt;Show details&lt;/a&gt;`</li>
<li>Untrusted data -&gt; `encodeURIComponent()`</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdfa3a87" class="outline-5">
<h5 id="orgdfa3a87"><span class="section-number-5">1.1.3.3</span> Use <a href="https://www.owasp.org/index.php/Category:OWASP_Enterprise_Security_API">proven utilities</a> for encoding.</h5>
</div>
<div id="outline-container-orgad4edee" class="outline-5">
<h5 id="orgad4edee"><span class="section-number-5">1.1.3.4</span> DOM-based XSS: Encode both on the server and client side.</h5>
</div>
<div id="outline-container-org9e2349e" class="outline-5">
<h5 id="org9e2349e"><span class="section-number-5">1.1.3.5</span> Add `HTTPOnly`, `Secure` attributes on the Session cookie:</h5>
<div class="outline-text-5" id="text-1-1-3-5">
<div class="org-src-container">
<pre class="src src-javascript">app.use<span style="color: #c5c8c6;">(</span>express.session<span style="color: #8abeb7;">(</span><span style="color: #f0c674;">{</span>
    secret: <span style="color: #8abeb7;">"s3Cur3"</span>,
    key: <span style="color: #8abeb7;">"sessionId"</span>,
    cookie: <span style="color: #b5bd68;">{</span>
        httpOnly: <span style="color: #81a2be;">true</span>,
        secure: <span style="color: #81a2be;">true</span>
    <span style="color: #b5bd68;">}</span>
<span style="color: #f0c674;">}</span><span style="color: #8abeb7;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7366d8b" class="outline-5">
<h5 id="org7366d8b"><span class="section-number-5">1.1.3.6</span> Add <b>content security policy</b> header</h5>
<div class="outline-text-5" id="text-1-1-3-6">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #b5bd68;">var</span> <span style="color: #f0c674;">policy</span> = <span style="color: #c5c8c6;">{</span>
    defaultPolicy: <span style="color: #8abeb7;">{</span>
        <span style="color: #8abeb7;">"default-src"</span>: <span style="color: #f0c674;">[</span><span style="color: #8abeb7;">"'self'"</span><span style="color: #f0c674;">]</span>,
        <span style="color: #8abeb7;">"img-src"</span>: <span style="color: #f0c674;">[</span><span style="color: #8abeb7;">"static.example.com"</span><span style="color: #f0c674;">]</span>
    <span style="color: #8abeb7;">}</span>
<span style="color: #c5c8c6;">}</span>

helmet.csp.policy<span style="color: #c5c8c6;">(</span>policy<span style="color: #c5c8c6;">)</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1a5f582" class="outline-4">
<h4 id="org1a5f582"><span class="section-number-4">1.1.4</span> HTTP parameter pollution</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Express populate HTTP request parameters with the same name in an array.
</p>
<pre class="example">
// POST firstname=John&amp;firstname=Mary
req.body.firstname
// =&gt; ["John", "Mary"]
</pre>

<p>
This mechanism can be exploited by an attacker to:
</p>
</div>
<div id="outline-container-orge8d9b38" class="outline-5">
<h5 id="orge8d9b38"><span class="section-number-5">1.1.4.1</span> trigger type errors on the server (uncaught errors crash it and cause DoS)</h5>
</div>
<div id="outline-container-org85e43d3" class="outline-5">
<h5 id="org85e43d3"><span class="section-number-5">1.1.4.2</span> modify application behavior (e.g. store arrays in the DB)</h5>
</div>
<div id="outline-container-orgaf02205" class="outline-5">
<h5 id="orgaf02205"><span class="section-number-5">1.1.4.3</span> bypass input validation applied on strings in the code, WAF, browser filters</h5>
<div class="outline-text-5" id="text-1-1-4-3">
<pre class="example">
["John", "John"] + "Doe"
// =&gt; "John, John Doe"
</pre>

<p>
Countermeasures:
</p>
</div>
</div>
<div id="outline-container-org3ba2177" class="outline-5">
<h5 id="org3ba2177"><span class="section-number-5">1.1.4.4</span> <b>Check the expected type</b> as a part of input validation.</h5>
</div>
<div id="outline-container-org47f0e3d" class="outline-5">
<h5 id="org47f0e3d"><span class="section-number-5">1.1.4.5</span> Incorporate <b>input fuzzing</b> into test suites to discover problems.</h5>
</div>
<div id="outline-container-org182f393" class="outline-5">
<h5 id="org182f393"><span class="section-number-5">1.1.4.6</span> Implement a <b>robust error handling mechanism</b>, using `try/catch`, `domain` and `cluster`.</h5>
</div>
</div>

<div id="outline-container-orgf7a1b9f" class="outline-4">
<h4 id="orgf7a1b9f"><span class="section-number-4">1.1.5</span> Regular Expression Denial of Service (REDoS)</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Evil regexps can take exponential execution time when applied to certain
non-matching inputs. By default, regexps get executed in the event loop thread,
so it can be exploited for DoS attacks.
</p>

<p>
Evil regexp pattern requiremenets:
</p>
</div>
<div id="outline-container-orgb0a8aa0" class="outline-5">
<h5 id="orgb0a8aa0"><span class="section-number-5">1.1.5.1</span> Grouping with repetition</h5>
</div>
<div id="outline-container-org6b40ed5" class="outline-5">
<h5 id="org6b40ed5"><span class="section-number-5">1.1.5.2</span> Inside repeated group, repetition (`(a+)+`) or alternation with overlapping (`(a|aa)+`)</h5>
</div>
<div id="outline-container-orgeffb7dd" class="outline-5">
<h5 id="orgeffb7dd"><span class="section-number-5">1.1.5.3</span> Example: Input pattern `aaaaaaaaaaaaa!` for a commonly used URL validation regexp</h5>
<div class="outline-text-5" id="text-1-1-5-3">
<ul class="org-ul">
<li>30 input characters take 6sec, 40 take 3hr 46min.</li>
</ul>


<p>
Review the regexps in the code for evil patterns.
Do not use user supplied inputs as regexps.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb89374a" class="outline-4">
<h4 id="orgb89374a"><span class="section-number-4">1.1.6</span> Don't use eval</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
Indirect forms of `eval`:
</p>
<pre class="example">
setInterval(String, number);
setTimeout(String, number);
new Function(String);
</pre>
</div>
</div>

<div id="outline-container-org69680d8" class="outline-4">
<h4 id="org69680d8"><span class="section-number-4">1.1.7</span> Avoid command injection</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
`child<sub>process.exec</sub>` is actually a `bash` interpreter, not a program launcher.
Do not pass user input to `child<sub>process.exec</sub>` to avoid potential commands being injected through subshells.
Using `child<sub>process.execFile</sub>` is a safe alternative.
</p>
</div>
</div>

<div id="outline-container-org8507e07" class="outline-4">
<h4 id="org8507e07"><span class="section-number-4">1.1.8</span> Temp files</h4>
<div class="outline-text-4" id="text-1-1-8">
<p>
Instead of creating temporary files (to avoid disk space usage) use Streams.
</p>
</div>
</div>

<div id="outline-container-org5abbc66" class="outline-4">
<h4 id="org5abbc66"><span class="section-number-4">1.1.9</span> Cookie theft</h4>
<div class="outline-text-4" id="text-1-1-9">
<p>
Any third-party javascript can read cookies on the page it's being run.
To prevent this, set the `HttpOnly` flag on cookies.
</p>
</div>
</div>

<div id="outline-container-org08b194a" class="outline-4">
<h4 id="org08b194a"><span class="section-number-4">1.1.10</span> Content Security Policy</h4>
<div class="outline-text-4" id="text-1-1-10">
<p>
Introduce a security poilicy for your domain through an HTTP header e.g. `Content-Security-Policy: default-src 'self' *.home.com`.
</p>
</div>
</div>

<div id="outline-container-orgaa02982" class="outline-4">
<h4 id="orgaa02982"><span class="section-number-4">1.1.11</span> Tools</h4>
<div class="outline-text-4" id="text-1-1-11">
</div><div id="outline-container-org41259a0" class="outline-5">
<h5 id="org41259a0"><span class="section-number-5">1.1.11.1</span> Helmet</h5>
<div class="outline-text-5" id="text-1-1-11-1">
<p>
<a href="https://github.com/evilpacket/helmet">https://github.com/evilpacket/helmet</a>
Helmet provides middleware for securing a node.js application.
</p>
</div>
</div>

<div id="outline-container-orgac891cc" class="outline-5">
<h5 id="orgac891cc"><span class="section-number-5">1.1.11.2</span> npm shrinkwrap</h5>
<div class="outline-text-5" id="text-1-1-11-2">
<p>
Locks down dependency versions recursively - useful for making releases.
</p>
</div>
</div>

<div id="outline-container-orgee9cf2e" class="outline-5">
<h5 id="orgee9cf2e"><span class="section-number-5">1.1.11.3</span> retire.js</h5>
<div class="outline-text-5" id="text-1-1-11-3">
<p>
retire.js detects module versions with known vulnerabilities (both node and browser modules).
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
